Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.FindDocumentWindowByHandle(System.IntPtr)
Searches all document windows for a window with the specified handle.
handle:  Input handle of the window to find

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.MoveDocumentWindow(Autodesk.AutoCAD.Windows.DocumentWindow,System.Int32)
Changes the order of a document window.
documentWindow:  Document window to be moved
newIndex:  New index for where to put the document window moved as the new position, the range for this parameter should be between 0 and Count-1

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.DocumentWindowFloated
Fired when a document window is dragged out from the MDI child frame into a floating window.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.DocumentWindowDocked
Fired when a document window is docked from a floating state back to the MDI child frame.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.DocumentWindowToBeDocked
Fired when a document window is about to be docked from a floating state back to the MDI child frame.