Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Closed
Wraps the following functions: AcTrayItemBubbleWindowControl.SetCallback, AcTrayItemBubbleWindowControl.GetCallbackDataAcTrayItemBubbleWindowControl.SetCallback sets the callback function and callback data for the bubble window.AcTrayItemBubbleWindowControl.GetCallbackData returns a pointer to the bubble window's callback data.