Autodesk.AutoCAD.ApplicationServices.DocumentWindowFloatedOrDockedEventArgs
This is the base class for the DocumentWindowDockedEventArgs,DocumentWindowFloatedEventArgs, and DocumentWindowToBeDockedEventArgs classes.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowFloatedOrDockedEventArgs.DocumentWindow
Identify of the document window that was docked or floated.