Autodesk.AutoCAD.Windows.PaletteSet.switchVisualBrowser(System.Int32,System.Boolean,System.String)
Switches the current tab to a specific tab and controls the display of the content on the tab. Note: Related to the Blocks palette and is for internal use only.
index:  Input integer that references which tab to set current
bVisual:  Input Boolean that controls whether the content is displayed
url:  Input string that specifies the URL to the related content