Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Undo
This wraps AcEdInplaceTextEditor::undo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Redo
This wraps AcEdInplaceTextEditor::redo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.RemoveHightlight
This wraps AcEdInplaceTextEditor::removeHightlight().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ParagraphDialog
This wraps AcEdInplaceTextEditor::invokeParagraphDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.WipeoutDialog
This wraps AcEdInplaceTextEditor::invokeWipeoutDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ImportTextDialog
This wraps AcEdInplaceTextEditor::invokeImportTextDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.NumberingMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This wraps AcEdInplaceTextEditor::numberingMenusInput().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanRedo
This wraps AcEdInplaceTextEditor::canRedo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Annotative
This wraps AcEdInplaceTextEditor::annotative() and AcEdInplaceTextEditor::setAnnotative().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.TableCell
This wraps AcEdInplaceTextEditor::isTableCell().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SpellerEnabled
This wraps AcEdInplaceTextEditor::spellerEnabled() and AcEdInplaceTextEditor::toggleSpelling().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.RulerHidden
This wraps AcEdInplaceTextEditor::rulerHidden() and AcEdInplaceTextEditor::setRulerHidden().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.OpaqueBackground
This wraps AcEdInplaceTextEditor::opaqueBackground() and AcEdInplaceTextEditor::setOpaqueBackground().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ForcedOpaqueBackground
This wraps AcEdInplaceTextEditor::forcedOpaqueBackground().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ToolbarHidden
This wraps AcEdInplaceTextEditor::toolbarHidden() and AcEdInplaceTextEditor::setToolbarHidden().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ToolbarOptionHidden
This wraps AcEdInplaceTextEditor::toolbarOptionHidden() and AcEdInplaceTextEditor::setToolbarOptionHidden().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanExitEditor
This wraps AcEdInplaceTextEditor::canExitInplaceEditor() and AcEdInplaceTextEditor::setCanExitInplaceEditor().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Wysiwyg
This wraps AcEdInplaceTextEditor::wysiwyg() and AcEdInplaceTextEditor::enableWysiwyg().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.UndoRecordingDisabled
This wraps AcEdInplaceTextEditor::undoRecordingDisabled() and AcEdInplaceTextEditor::setUndoRecordingDisable().