Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.Flags
This wraps AcEdInplaceTextEditorSettings::editFlags() and AcEdInplaceTextEditorSettings::setEditFlags().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.Type
This wraps AcEdInplaceTextEditorSettings::sourceEntityType() and AcEdInplaceTextEditorSettings::setSourceEntityType().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.TabSupported
This wraps AcEdInplaceTextEditorSettings::tabSupported() and AcEdInplaceTextEditorSettings::setSupportTab().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.SimpleMText
This wraps AcEdInplaceTextEditorSettings::simpleMText() and AcEdInplaceTextEditorSettings::setSimpleMText().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.DefinedHeight
This wraps AcEdInplaceTextEditorSettings::definedHeight() and AcEdInplaceTextEditorSettings::setDefinedHeight().