Autodesk.AutoCAD.Windows.DocumentWindow.DocumentWindowUpdated
This event will be sent when the document for the document window is updated.

Autodesk.AutoCAD.Windows.DocumentWindow.IsFloating
Indicates whether the document window is floating.