Autodesk.AutoCAD.ApplicationServices.DocumentWindowActivatedEventArgs
Used in DocumentWindowActivated event as event args.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowActivatedEventArgs.DocumentWindow
Identify of the document window that was just activated.