Autodesk.AutoCAD.ApplicationServices.RecentDocument
Class represents a recently opened document or drawing.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.FromPath(System.String)
Searches the specified path for a recent document file.
path:  Input string as a path name

Autodesk.AutoCAD.ApplicationServices.RecentDocument.Path
Returns the path to the file associated with the document.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.Version
Returns the version of the document.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.LastSavedBy
Returns the Last Saved By value assigned to the document.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.CurrentlyOpenBy
Returns true if the document is currently open in the application.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.Preview
Returns the bitmap of the preview associated with the document.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.IsPinned
Returns true if the document is pinned on the Start page or Application menu.

Autodesk.AutoCAD.ApplicationServices.RecentDocument.IsClosed
Returns true if the document is currently closed in the application.